# SetParamStyleType

```pascal
PROCEDURE SetParamStyleType(
				hStyle    : HANDLE;
				paramName : STRING;
				styleType : INTEGER);
```

```python
def vs.SetParamStyleType(hStyle, paramName, styleType):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hStyle|HANDLE|Handle to a symbol containing a plug-in style.|
|paramName|STRING|Name of parameter to set|
|styleType|INTEGER|0 = By Instance 1 = By Style|

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Custom